Revit 2026 API

# ViewGetFilters Method

---

Gets the filters applied to the view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ICollection<ElementId> GetFilters()
```
```vb
Public Function GetFilters As ICollection(Of ElementId)
```
```cpp
public:
ICollection<ElementId^>^ GetFilters()
```
```fsharp
member GetFilters : unit -> ICollection<ElementId>
```

#### Return Value

ICollectionElementId The ElementIds of the Filters.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The element "this View" does not belong to a project document. -or- The view type does not support Visibility/Graphics Overriddes. |

Note that this method returns filters in a set sorted according to their ids. To get filters in the order they are applied to the view use GetOrderedFilters.

#### Reference

View Class

Autodesk.Revit.DB Namespace